OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
    /* enter operational state */
    ohci0_HcControl_tamp = _ohci0->HcControl;
    _ohci0->HcControl = (ohci0_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (2U << USBH_HcControl_HCFS_Pos);
#endif

#ifdef ENABLE_EHCI

    _ehci->UCMDR = ehci_UCMDR;

    if (_ehci->UPSCR[0] & HSUSBH_UPSCR_PE_Msk)
    {
        _ehci->UPSCR[0] |= HSUSBH_UPSCR_FPR_Msk;
        delay_us(25000);                         /* keep resume signal for 25 ms */
        _ehci->UPSCR[0] &= ~HSUSBH_UPSCR_FPR_Msk;
    }

    delay_us(1000);
#endif

#ifdef ENABLE_OHCI1
    uint32_t ohci1_HcControl_tamp = 0U;
    /*Synopsys*/
    ohci1_HcControl_tamp = _ohci1->HcControl;
    _ohci1->HcControl = (ohci1_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (1U << USBH_HcControl_HCFS_Pos);

    if (_ohci1->HcRhPortStatus[0] & USBH_HcRhPortStatus_PSS_Msk)
    {
        _ohci1->HcRhPortStatus[0] = USBH_HcRhPortStatus_POCI_Msk;   /* clear suspend status */
    }

    delay_us(30000);                       /* wait at least 30ms for Host to resume device */

    /* enter operational state */
    ohci1_HcControl_tamp = _ohci1->HcControl;
    _ohci1->HcControl = (ohci1_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (2U << USBH_HcControl_HCFS_Pos);
#endif


}

void usbh_core_deinit(void)
{
    int   time_out = 10;   /* ms */

#ifdef ENABLE_OHCI0
    uint32_t ohci0_HcControl_tamp = 0;
    /*hydra*/
    //disable ohci irq
    DISABLE_OHCI0_IRQ();
    //disable ohci mode.
    ohci0_HcControl_tamp = _ohci0->HcControl;
    _ohci0->HcControl = (ohci0_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (3 << USBH_HcControl_HCFS_Pos);

    while (time_out > 0)
    {
        if (((_ohci0->HcControl & (3 << USBH_HcControl_HCFS_Pos)) == (3 << USBH_HcControl_HCFS_Pos)) && !(_ohci0->HcCommandStatus & USBH1_HcCommandStatus_HCR_Msk))
        {
            printf("ohci0_deinit done\n");
            break;
        }

        delay_us(1000);         /* wait 1 ms */
        time_out --;
    }

    if (time_out == 0)
    {
        USB_error("ohci0_deinit - HCFS error!\n");
    }

    delay_us(20000);                       /* wait at least 20ms */
#endif

#ifdef ENABLE_OHCI1
    time_out = 10; /* ms */
    uint32_t ohci1_HcControl_tamp = 0;
    /*Synopsys*/
    //disable ohci irq
    DISABLE_OHCI1_IRQ();
    //disable ohci mode.
    ohci1_HcControl_tamp = _ohci1->HcControl;
    _ohci1->HcControl = ((ohci1_HcControl_tamp & ~USBH_HcControl_HCFS_Msk) | (3 << USBH_HcControl_HCFS_Pos));

    while (time_out > 0)
    {
        if (((_ohci1->HcControl & (3 << USBH_HcControl_HCFS_Pos)) == (3 << USBH_HcControl_HCFS_Pos)) && !(_ohci1->HcCommandStatus & USBH1_HcCommandStatus_HCR_Msk))
        {
            printf("ohci1_deinit done\n");
            break;
        }

        delay_us(1000);         /* wait 1 ms */
        time_out --;
    }

    if (time_out == 0)
    {
        USB_error("ohci1_deinit - HCFS error!\n");
    }

    delay_us(20000);                       /* wait at least 20ms */
#endif

#ifdef ENABLE_EHCI
    time_out = 10; /* ms */
    /*Synopsys*/
    //disable ehci irq
    DISABLE_EHCI_IRQ();
    //disable ehci mode.
    _ehci->UCMDR &= ~(HSUSBH_UCMDR_PSEN_Msk | HSUSBH_UCMDR_ASEN_Msk | HSUSBH_UCMDR_RUN_Msk);

    while (time_out > 0)
    {
        if (!(_ehci->UCMDR & HSUSBH_UCMDR_RUN_Msk) && (_ehci->USTSR & HSUSBH_USTSR_HCHalted_Msk))
        {
            printf("ehci_deinit done\n");
            break;
        }

        delay_us(1000);         /* wait 1 ms */
        time_out --;
    }

    if (time_out == 0)
    {
        USB_error("ehci_deinit - RUN/HCHalted error!\n");
    }

    delay_us(1000);
#endif
}

/// @cond HIDDEN_SYMBOLS

/**
  * @brief    Register an USB device class or vendor driver to lightweight USB stack.
  *           All USB device drivers must be registered before usbh_core_init() called.
  * @param[in]  udrv   The USB device driver to be registered.
  * @return   Driver registration success or not.
  * @retval   0  Success
  * @retval   USBH_ERR_MEMORY_OUT   Registered drivers have reached MAX_UDEV_DRIVER limitation.
  */
int  usbh_register_driver(UDEV_DRV_T *udrv)
{
    int   i;

    for (i = 0; i < MAX_UDEV_DRIVER; i++)
    {
        if (_drivers[i] == udrv)
        {
            return 0;                  /* already registered, do nothing */
        }

        if (_drivers[i] == USBNULL)
        {
            _drivers[i] = udrv;        /* register this driver */
            return 0;
        }
    }

    return USBH_ERR_MEMORY_OUT;        /* reached MAX_UDEV_DRIVER limitation, aborted */
}

/**
  * @brief    Execute an USB request in control transfer. This function returns after the request
  *           was done or aborted.
  * @param[in]  udev            The target USB device.
  * @param[in]  bmRequestType   Characteristics of request
  * @param[in]  bRequest        Specific request
  * @param[in]  wValue          Word-sized field that varies according to request
  * @param[in]  wIndex          Word-sized field that varies according to request
  * @param[in]  wLength         Number of bytes to transfer if there is a Data stage
  * @param[in]  buff            Data buffer used in data stage
  * @param[in]  data_len        Length of data to be transmitted/received
  * @param[out] xfer_len        Transmitted/received length of data
  * @param[in]  timeout         Time-out limit (in 10ms - timer tick) of this transfer
  * @retval   0     Transfer success
  * @retval   < 0   Transfer failed. Refer to error code definitions.
  */
int usbh_ctrl_xfer(UDEV_T *udev, uint8_t bmRequestType, uint8_t bRequest, uint16_t wValue, uint16_t wIndex,
                   uint16_t wLength, uint8_t *buff, uint32_t *xfer_len, uint32_t timeout)
{
    UTR_T      *utr;
    uint32_t   t0;
    int        status;

    *xfer_len = 0;

    //if(check_device(udev))
    //    return USBH_ERR_INVALID_PARAM;

    utr = alloc_utr(udev);

    if (utr == USBNULL)
    {
        return USBH_ERR_MEMORY_OUT;
    }

    utr->setup.bmRequestType = bmRequestType;
    utr->setup.bRequest   = bRequest;
    utr->setup.wValue     = wValue;
    utr->setup.wIndex     = wIndex;
    utr->setup.wLength    = wLength;

