OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
            case USB_DT_INTERFACE:
                (void)usbh_dump_interface_descriptor((DESC_IF_T *)bptr);
                break;

            case USB_DT_ENDPOINT:
                (void)usbh_dump_endpoint_descriptor((DESC_EP_T *)bptr);
                break;

            default:
                hdr = (DESC_HDR_T *)bptr;
                USB_debug("\n!![Unknown Descriptor]\n");
                USB_debug("----------------------------------------------\n");
                USB_debug("Length              = %2d\n",  hdr->bLength);
                USB_debug("DescriptorType      = %02x\n", hdr->bDescriptorType);
                break;
        }

        if (bptr[0] == 0U)
        {
            break;
        }

        tlen -= (int)bptr[0];
        bptr += bptr[0];
    }
}
#endif
/**
 *  @brief  Execute USB standard request SET ADDRESS.
 *  @retval   0  Success
 *  @retval   < 0   Failed. Refer to error code definitions.
 */
static int usbh_set_address(UDEV_T *udev)
{
    uint32_t  read_len;
    int       dev_num;
    int       ret;

    if (udev->dev_num != 0U)
    {
        return USBH_ERR_SET_DEV_ADDR;
    }

    dev_num = alloc_dev_address();

    /*------------------------------------------------------------------------------------*/
    /* Issue SET ADDRESS command to set device address                                    */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_SET_ADDRESS, dev_num, 0, 0,
                         USBNULL, &read_len, 100);

    if (ret < 0)
    {
        free_dev_address(dev_num);
        return ret;
    }

    udev->dev_num = dev_num;

    return 0;
}

/**
 *  @brief  Execute USB standard request SET CONFIGURATION.
 *  @retval   0  Success
 *  @retval   < 0   Failed. Refer to error code definitions.
 */
int usbh_set_configuration(UDEV_T *udev, uint8_t conf_val)
{
    uint32_t  read_len;
    int       ret;

    /* Current configuration is the same. Do nothing. */
    if (udev->cur_conf == (int)conf_val)
    {
        return 0;
    }

    /* Set another configuration is currently not supported! */
    if (udev->cur_conf != -1)
    {
        return USBH_ERR_SET_CONFIG;
    }

    /*------------------------------------------------------------------------------------*/
    /* Issue SET CONFIGURATION command to select device configuration                     */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_SET_CONFIGURATION, conf_val, 0, 0,
                         USBNULL, &read_len, 300);

    if (ret < 0)
    {
        return ret;
    }

    udev->cur_conf = (int8_t)conf_val;

    return 0;
}

/**
 *  @brief    Select an alternate setting for the specified interface.
 *  @param[in]  iface        The interface
 *  @param[in]  alt_setting  Desired alternative setting
 *  @retval   0  Success
 *  @retval   < 0   Failed. Refer to error code definitions.
 */
int usbh_set_interface(IFACE_T *iface, uint16_t alt_setting)
{
    ALT_IFACE_T  *aif = USBNULL;

    uint8_t      alt_num;
    uint32_t     xfer_len;
    int          i;
    int          ret;

    if (alt_setting > 0xFFU)
    {
        return USBH_ERR_NOT_FOUND;
    }

    alt_num = (uint8_t)alt_setting;

    for (i = 0; i < (int)iface->num_alt; i++)
    {
        const DESC_IF_T    *ifd;
        ifd = iface->alt[i].ifd;

        if ((ifd != USBNULL) && (ifd->bAlternateSetting == alt_num))
        {
            aif = &iface->alt[i];
            break;
        }
    }

    if (aif == USBNULL)
    {
        return USBH_ERR_NOT_FOUND;          /* cannot find desired alternative setting    */
    }

    ret = usbh_ctrl_xfer(iface->udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_IFACE,
                         USB_REQ_SET_INTERFACE, alt_setting, iface->if_num, 0,
                         USBNULL, &xfer_len, 100);

    if (ret == 0)
    {
        iface->aif = aif;                   /* change active alternative setting          */
    }

    return ret;
}

/**
 *  @brief  Get device descriptor from the USB device.
 *  @param[out] desc_buff  Data buffer to receive device descriptor data.
 *  @return   Success or not.
 *  @retval   0  Success
 *  @retval   Otherwise  Failed
 */
int usbh_get_device_descriptor(UDEV_T *udev, DESC_DEV_T *desc_buff)
{
    uint32_t  read_len;
    int       ret = 0;
    int       retry;
    int       timeout = 10;

    for (retry = 0; retry < 3; retry++)
    {
        ret = usbh_ctrl_xfer(udev, REQ_TYPE_IN | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                             USB_REQ_GET_DESCRIPTOR,
                             (uint16_t)(((uint32_t)USB_DT_STANDARD | (uint32_t)USB_DT_DEVICE) << 8U), 0, sizeof(DESC_DEV_T),
                             (uint8_t *)desc_buff, &read_len, timeout);

        if (ret == 0)
        {
            return 0;
        }

        USB_debug("Get device descriptor failed - %d, retry!\n", ret);
    }

    return ret;
}

/**
 *  @brief Get configuration descriptor total length from the USB device.
 *
 *  @param[in] udev The target USB device.
 *  @param[in] conf_header Data buffer to receive configuration descriptor header.
 *  @return   Success or not.
 *  @retval   0  Success
 *  @retval   Otherwise  Failed
 */

int usbh_get_config_descripotr_total_length(UDEV_T *udev, DESC_CONF_T *conf_header)
{
    uint32_t  read_len;
    int       ret;

    /*------------------------------------------------------------------------------------*/
    /* Get Configuration Descriptor Header (9 bytes)                                      */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_IN | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_GET_DESCRIPTOR,
                         (uint16_t)(((uint32_t)USB_DT_STANDARD | (uint32_t)USB_DT_CONFIGURATION) << 8U), 0,
                         sizeof(DESC_CONF_T), // read 9 bytes only.
                         (uint8_t *)conf_header, &read_len, 200);

