OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
    if (ret < 0)
    {
        USB_error("Get config descriptor header failed!\n");
        return ret;
    }

    return 0;
}

/**
 *  @brief  Get configuration descriptor from the USB device.
 *  @param[out] desc_buff  Data buffer to receive configuration descriptor data.
 *  @param[in]  buff_len   Valid length of <desc_buff>
 *  @return   Success or not.
 *  @retval   0  Success
 *  @retval   Otherwise  Failed
 */
int usbh_get_config_descriptor(UDEV_T *udev, uint8_t *desc_buff, int buff_len)
{
    uint32_t  read_len;
    DESC_CONF_T  *conf = (DESC_CONF_T *)desc_buff;
    int       ret;

    /*------------------------------------------------------------------------------------*/
    /* Issue GET DESCRIPTOR command to get configuration descriptor                       */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_IN | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_GET_DESCRIPTOR,
                         (uint16_t)(((uint32_t)USB_DT_STANDARD | (uint32_t)USB_DT_CONFIGURATION) << 8U), 0, 9,
                         desc_buff, &read_len, 200);

    if (ret < 0)
    {
        return ret;
    }

    if (conf->wTotalLength > buff_len)
    {
        USB_error("Device configuration %d length > %d!\n", conf->wTotalLength, buff_len);
        return USBH_ERR_DATA_OVERRUN;
    }

    read_len = conf->wTotalLength;

    ret = usbh_ctrl_xfer(udev, REQ_TYPE_IN | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_GET_DESCRIPTOR,
                         (uint16_t)(((uint32_t)USB_DT_STANDARD | (uint32_t)USB_DT_CONFIGURATION) << 8U), 0, read_len,
                         desc_buff, &read_len, 200);

    if (ret < 0)
    {
        return ret;
    }

    return 0;
}
#if 0
/**
 *  @brief  Get string descriptor from the USB device.
  * @param[in]  udev       The target USB device.
 *  @param[in]  index      Index of string descriptor
 *  @param[out] desc_buff  Data buffer to receive the string descriptor data.
 *  @param[in]  buff_len   Valid length of <desc_buff>
 *  @return   Success or not.
 *  @retval   0  Success
 *  @retval   Otherwise  Failed
 */
static int usbh_get_string_descriptor(UDEV_T *udev, int index, uint8_t *desc_buff, int buff_len)
{
    uint32_t  read_len;
    int       ret;

    /*------------------------------------------------------------------------------------*/
    /* Issue GET DESCRIPTOR command to get configuration descriptor                       */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_IN | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_GET_DESCRIPTOR,
                         (uint16_t)((((uint32_t)USB_DT_STANDARD | (uint32_t)USB_DT_STRING) << 8U) | index), 0x0409, buff_len,
                         desc_buff, &read_len, 200);
    return ret;
}
#endif
/**
 *  @brief  Issue a standard request SET_FEATURE to clear USB device endpoint halt state.
 *  @param[in] ep_addr  Endpoint to be clear halt.
 *  @return   Success or not.
 *  @retval   0  Success
 *  @retval   Otherwise  Failed
 */
int usbh_clear_halt(UDEV_T *udev, uint16_t ep_addr)
{
    uint32_t  read_len;

    USB_debug("Clear endpoint 0x%x halt.\n", ep_addr);
    return usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_EP,
                          USB_REQ_CLEAR_FEATURE, 0, ep_addr, 0,
                          USBNULL, &read_len, 100);
}

static int  usbh_parse_endpoint(ALT_IFACE_T *alt, int ep_idx, uint8_t *desc_buff, int len)
{
    DESC_EP_T    *ep_desc = USBNULL;
    int          parsed_len = 0;
    unsigned int pksz;
    int          len_tmp = len;

    while (len_tmp > 0)
    {
        ep_desc = (DESC_EP_T *)&desc_buff[parsed_len];

        if ((len_tmp < ep_desc->bLength) || (ep_desc->bLength < 2))
        {
            USB_error("ERR DESCRIPTOR EP LEN [0x%X %d]\n", ep_desc->bDescriptorType, ep_desc->bLength);
            return USBH_ERR_DESCRIPTOR;
        }

        if (ep_desc->bDescriptorType == USB_DT_ENDPOINT)
        {
            break;     /* endpoint descriptor found */
        }

        /* unrecognized descriptor */
        USB_vdebug("ignore descriptor 0x%X %d\n", ep_desc->bDescriptorType, ep_desc->bLength);
        parsed_len += ep_desc->bLength;
        len_tmp -= ep_desc->bLength;
    }

    if (ep_desc == USBNULL)
    {
        USB_error("ERR - no endpoint descriptor found!\n");
        return USBH_ERR_DESCRIPTOR;
    }

    USB_vdebug("Descriptor Found - Alt: %d, Endpoint 0x%x, remaining len: %d\n", alt->ifd->bAlternateSetting, ep_desc->bEndpointAddress, len_tmp);

    alt->ep[ep_idx].bEndpointAddress = ep_desc->bEndpointAddress;
    alt->ep[ep_idx].bmAttributes     = ep_desc->bmAttributes;
    alt->ep[ep_idx].bInterval        = ep_desc->bInterval;
    /* HS isochronous/interrupt endpoints use wMaxPacketSize bits 12:11 for additional transactions per microframe. */
    pksz = ep_desc->wMaxPacketSize;
    pksz = (pksz & 0x07FFU) * (1U + ((pksz >> 11U) & 3U));
    alt->ep[ep_idx].wMaxPacketSize   = pksz;
    alt->ep[ep_idx].hw_pipe          = USBNULL;

    return parsed_len + ep_desc->bLength;
}

/**
  * @brief    Parse interface descriptor.
  * @param[in]  udev    The USB device.
  * @param[in]  desc_buff   Descriptor buffer
  * @param[in]  len         Remaining length of descriptors in buffer.
  * @return   Driver registration success or not.
  * @retval   0  Success
  * @retval   USBH_ERR_MEMORY_OUT   Registered drivers have reached MAX_UDEV_DRIVER limitation.
  */
static int  usbh_parse_interface(UDEV_T *udev, uint8_t *desc_buff, int len)
{
    int         i;
    int         matched;
    int         parsed_len = 0;
    DESC_HDR_T  *hdr = USBNULL;
    DESC_IF_T   *if_desc;
    IFACE_T     *iface = USBNULL;
    int         ret = -1;
    int         len_tmp = len;
    int8_t      bDone = 0;
    int8_t      bError = 0;

    iface = usbh_alloc_mem(sizeof(*iface)); /* create an interface                        */

