OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
    if (iface == USBNULL)
    {
        return USBH_ERR_MEMORY_OUT;
    }

    iface->udev = udev;
    iface->aif = &iface->alt[0];            /* Default active interface should be the
                                               first found alternative interface          */
    iface->if_num = ((DESC_IF_T *)desc_buff)->bInterfaceNumber;

    while ((len_tmp > 0) && (bDone == 0))
    {
        /*--------------------------------------------------------------------------------*/
        /* Find the first/next interface descriptor                                       */
        /*--------------------------------------------------------------------------------*/
        if_desc = (DESC_IF_T *)&desc_buff[parsed_len];

        if (if_desc->bDescriptorType != USB_DT_INTERFACE)
        {
            parsed_len += if_desc->bLength;
            len_tmp -= if_desc->bLength;
            continue;
        }

        if (if_desc->bInterfaceNumber != iface->if_num)
        {
            bDone = 1;                      /* parse_done                                 */
            continue;
        }

        if (if_desc->bNumEndpoints > MAX_EP_PER_IFACE)
        {
            USB_error("IF EP LIMITE %d\n", if_desc->bNumEndpoints);
            ret = USBH_ERR_IF_EP_LIMIT;
            bError = 1;
            bDone = 1;
            continue;
        }

        /* Step over the interface descriptor */
        parsed_len += if_desc->bLength;
        len_tmp -= if_desc->bLength;
        USB_vdebug("Descriptor Found - Interface %d, Alt: %d, num_alt:%d, remaining len: %d\n", if_desc->bInterfaceNumber, if_desc->bAlternateSetting, iface->num_alt, len_tmp);

        /*--------------------------------------------------------------------------------*/
        /* Add to alternative interface list                                              */
        /*--------------------------------------------------------------------------------*/
        if (iface->num_alt >= (uint8_t)MAX_ALT_PER_IFACE)
        {
            ret = USBH_ERR_IF_ALT_LIMIT;
            bError = 1;
            bDone = 1;
            continue;
        }

        /*--------------------------------------------------------------------------------*/
        /* Find the next alternative interface or endpoint descriptor                     */
        /*--------------------------------------------------------------------------------*/
        while ((len_tmp > 0) && (bDone == 0))
        {
            hdr = (DESC_HDR_T *)&desc_buff[parsed_len];

            if ((len_tmp < hdr->bLength) || (hdr->bLength < 2))
            {
                USB_error("ERR DESCRIPTOR IF LEN [0x%X %d]\n", hdr->bDescriptorType, hdr->bLength);
                ret = USBH_ERR_DESCRIPTOR;
                bError = 1;
                bDone = 1;
            }
            else if (hdr->bDescriptorType == USB_DT_CONFIGURATION)
            {
                bDone = 1;                  /* is other configuration, parsing completed  */
            }
            else if ((hdr->bDescriptorType == USB_DT_INTERFACE) || (hdr->bDescriptorType == USB_DT_ENDPOINT))
            {
                break;                      /* the first endpoint descriptor found        */
            }
            else
            {
                /* unrecognized descriptor */
                USB_vdebug("ignore descriptor 0x%X %d\n", hdr->bDescriptorType, hdr->bLength);
                parsed_len += hdr->bLength;
                len_tmp -= hdr->bLength;
            }
        }

        if (bDone != 0)
        {
            continue;
        }

        iface->alt[iface->num_alt].ifd = if_desc;
        iface->num_alt++;

        if (len_tmp == 0)
        {
            bDone = 1;                      /* parse_done                                 */
            continue;
        }

        if (hdr->bDescriptorType == USB_DT_INTERFACE)
        {
            continue;                       /* is the next interface descriptor           */
        }

        USB_vdebug("Finding %d endpoints of interface %d, alt %d...\n", if_desc->bNumEndpoints, if_desc->bInterfaceNumber, if_desc->bAlternateSetting);

        /* parsing all endpoint descriptors */
        for (i = 0; (i < if_desc->bNumEndpoints) && (bDone == 0); i++)
        {
            ret = usbh_parse_endpoint(&iface->alt[iface->num_alt - 1U], i, &desc_buff[parsed_len], len_tmp);

            if (ret < 0)
            {
                bError = 1;
                bDone = 1;
            }
            else
            {
                parsed_len += ret;
                len_tmp -= ret;
                USB_vdebug("EP parse remaining %d\n", len_tmp);
            }
        }
    }

    /* error path */
    if (bError != 0)
    {
        (void)usbh_free_mem(iface, sizeof(*iface));
        return ret;
    }

    /*
     *  Probing all registered USB device drivers to find a matched driver.
     */
    matched = 0;

    for (i = 0; i < MAX_UDEV_DRIVER; i++)
    {
        if ((_drivers[i] != USBNULL) && (_drivers[i]->probe(iface) == 0))
        {
            matched = 1;
            break;
        }
    }

    if ((matched) && (i < MAX_UDEV_DRIVER))
    {
        iface->driver = _drivers[i];        /* have a driver now */
        iface->next = USBNULL;

        /* Added this interface to USB device interface list */
        if (udev->iface_list == USBNULL)
        {
            udev->iface_list = iface;
        }
        else
        {
            iface->next = udev->iface_list;
            udev->iface_list = iface;
        }
    }
    else
    {
        (void)usbh_free_mem(iface, sizeof(*iface));
        iface = USBNULL;
    }

    return parsed_len;
}

static int  usbh_parse_configuration(UDEV_T *udev, uint8_t *desc_buff)
{
    const DESC_CONF_T  *config = (const DESC_CONF_T *)desc_buff;
    int    i;
    int    len;
    int    parsed_len;

    len = config->wTotalLength;

    parsed_len = config->bLength;
    len -= config->bLength;

    USB_vdebug("Parsing CONFIG =>\n");

    for (i = 0; i < config->bNumInterfaces; i++)
    {
        /*
         *  find the next interface descriptor
         */
        while (len >= (int)sizeof(DESC_HDR_T))
        {
            DESC_HDR_T   *hdr;
            hdr = (DESC_HDR_T *)&desc_buff[parsed_len];

            if ((hdr->bLength > len) || (hdr->bLength < 2))
            {
                USB_error("ERR DESCRIPTOR CONFIG [%d]\n", hdr->bLength);
                return USBH_ERR_DESCRIPTOR;
            }

