OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
            if (hdr->bDescriptorType == USB_DT_INTERFACE)
            {
                break;
            }

            USB_debug("ignore descriptor 0x%X %d\n", hdr->bDescriptorType, hdr->bLength);

            parsed_len += hdr->bLength;
            len -= hdr->bLength;
        }

        int    ret;
        ret = usbh_parse_interface(udev, &desc_buff[parsed_len], len);

        if (ret < 0)
        {
            return ret;
        }

        parsed_len += ret;
        len -= ret;
        USB_vdebug("IFACE parse remaining %d\n", len);
    }

    if (len > 0)
    {
        USB_debug("ERR DESCRIPTOR CONFIG LEN %d\n", len);
        return USBH_ERR_DESCRIPTOR;
    }

    return len;
}
#if 0
static void print_usb_string(char *lead, uint8_t *str)
{
    int  len;
    int  i = 2;

    USB_debug("%s", lead);
    len = str[0];

    while (i < len)
    {
        USB_debug("%c", str[i]);
        i += 2;
    }

    USB_debug("\n");
}
#endif
int  connect_device(UDEV_T *udev)
{
    DESC_CONF_T  *conf;
    DESC_CONF_T  conf_header; // configer Header
    uint32_t     read_len;
    int          ret;
    uint16_t     conf_total_len;

    USB_debug("Connect device =>\n");

    delay_us(100 * 1000);                   /* initially, give 100 ms delay               */

    USB_debug("get device =>\n");
    (void)usbh_get_device_descriptor(udev, &udev->descriptor);

    (void)reset_device(udev);
    USB_debug("reset device =>\n");

    delay_us(100 * 1000);                   /* initially, give 100 ms delay               */

    ret = usbh_set_address(udev);

    if (ret < 0)
    {
        USB_debug("Set address command failed!!\n");
        return ret;
    }

    delay_us(100 * 1000);                   /* initially, give 100 ms delay               */

    USB_debug("New %s device address %d assigned.\n", (udev->speed == SPEED_HIGH) ? "high-speed" : ((udev->speed == SPEED_FULL) ? "full-speed" : "low-speed"), udev->dev_num);

    /* Get device descriptor again with new device address */
    ret = usbh_get_device_descriptor(udev, &udev->descriptor);

    if (ret < 0)
    {
        free_dev_address(udev->dev_num);
        return ret;
    }

#if  defined(DUMP_DESCRIPTOR) && defined(ENABLE_DEBUG_MSG)
    dump_device_descriptor(&udev->descriptor);
#endif

    if (udev->descriptor.bNumConfigurations != 1)
    {
        USB_debug("Warning! This device has multiple configurations [%d]. \n", udev->descriptor.bNumConfigurations);
    }

    /*------------------------------------------------------------------------------------*/
    /*  Step 1: Get Configuration Descriptor Header (9 bytes) first                       */
    /*------------------------------------------------------------------------------------*/
    ret = usbh_get_config_descripotr_total_length(udev, &conf_header);

    if (ret < 0)
    {
        USB_debug("Get config descriptor header failed!\n");
        free_dev_address(udev->dev_num);
        return ret;
    }

    conf_total_len = conf_header.wTotalLength;
    USB_debug("Config Descriptor Total Length: %d\n", conf_total_len);

    conf = (DESC_CONF_T *)usbh_alloc_mem(conf_total_len);

    if (conf == USBNULL)
    {
        free_dev_address(udev->dev_num);
        return USBH_ERR_MEMORY_OUT;
    }

    udev->cfd_buff = (uint8_t *)conf;

    /* Get configuration descriptor again with new device address */
    ret = usbh_get_config_descriptor(udev, (uint8_t *)conf, conf_total_len);

    if (ret < 0)
    {
        free_dev_address(udev->dev_num);
        return ret;
    }

#if  defined(DUMP_DESCRIPTOR) && defined(ENABLE_DEBUG_MSG)
    dump_config_descriptor(conf);
#endif

#if 0  /* printf string descriptors, for debug only */
    str_buff = (uint8_t *)usbh_alloc_mem(MAX_DESC_BUFF_SIZE);

    if (udev->descriptor.iManufacturer != 0)
    {
        (void)usbh_get_string_descriptor(udev, udev->descriptor.iManufacturer, str_buff, MAX_DESC_BUFF_SIZE);
        print_usb_string("Manufactor: ", str_buff);
    }

    if (udev->descriptor.iProduct != 0)
    {
        (void)usbh_get_string_descriptor(udev, udev->descriptor.iProduct, str_buff, MAX_DESC_BUFF_SIZE);
        print_usb_string("Product: ", str_buff);
    }

    if (udev->descriptor.iSerialNumber != 0)
    {
        (void)usbh_get_string_descriptor(udev, udev->descriptor.iSerialNumber, str_buff, MAX_DESC_BUFF_SIZE);
        print_usb_string("Serial Number: ", str_buff);
    }

    (void)usbh_free_mem(str_buff, MAX_DESC_BUFF_SIZE);
#endif

    /* Always select the first configuration */
    ret = usbh_set_configuration(udev, conf->bConfigurationValue);

    if (ret < 0)
    {
        USB_debug("Set configuration %d failed!\n", conf->bConfigurationValue);
        free_dev_address(udev->dev_num);
        return ret;
    }

    /* Parse the configuration/interface/endpoint descriptors and find corresponding drivers. */
    ret = usbh_parse_configuration(udev, (uint8_t *)conf);

    if (ret < 0)
    {
        USB_debug("Parse configuration %d failed!\n", conf->bConfigurationValue);
        free_dev_address(udev->dev_num);
        return ret;
    }

    if (conf->bmAttributes & (1U << 5))
    {
        /* If this configuration supports remote wakeup, enable it.                           */
        if (usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                           USB_REQ_SET_FEATURE, 0x01, 0x0000, 0x0000,
                           USBNULL, &read_len, 300) < 0)
        {
            USB_debug("Device does not accept remote wakeup enable command.\n");
        }
    }

    if (g_conn_func)
    {
        g_conn_func(udev, 0);
    }

    return ret;
}

int  usbh_reset_device(UDEV_T *udev)
{
    IFACE_T      *iface;
    DESC_CONF_T  *conf;
    uint32_t     read_len;
    uint16_t     conf_total_len;
    int          dev_num;
    int          ret;

    USB_debug("Reset device =>\n");

    (void)usbh_pooling_hubs();

    /*------------------------------------------------------------------------------------*/
    /*  Disconnect device                                                                 */
    /*------------------------------------------------------------------------------------*/

    if (g_disconn_func)
    {
        g_disconn_func(udev, 0);
    }

    (void)usbh_quit_xfer(udev, &(udev->ep0));    /* Quit control transfer if hw_pipe is not USBNULL.  */

    /* Notified all actived interface device driver  */
    iface = udev->iface_list;

    while (iface != USBNULL)
    {
        udev->iface_list = iface->next;
        iface->driver->disconnect(iface);
        (void)usbh_free_mem(iface, sizeof(*iface));
        iface = udev->iface_list;
    }

    /*------------------------------------------------------------------------------------*/
    /*  Reset device                                                                      */
    /*------------------------------------------------------------------------------------*/
    USB_debug("Port device =>\n");
    (void)reset_device(udev);


    delay_us(100 * 1000);                   /* initially, give 100 ms delay               */


    /*------------------------------------------------------------------------------------*/
    /*  Set address (use current address)                                                 */
    /*------------------------------------------------------------------------------------*/
    USB_debug("Set Address =>\n");
    dev_num = udev->dev_num;
    udev->dev_num = 0;
    /* Issue SET ADDRESS command to set the same device address                           */
    ret = usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                         USB_REQ_SET_ADDRESS, dev_num, 0, 0,
                         USBNULL, &read_len, 100);
    udev->dev_num = dev_num;

