OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_core/usb_core.c
    if (ret < 0)
    {
        return ret;
    }

    delay_us(100 * 1000);                   /* after set address, give 100 ms delay       */

    /*------------------------------------------------------------------------------------*/
    /*  Get device descriptor                                                             */
    /*------------------------------------------------------------------------------------*/
    USB_debug("Get descriptor =>\n");
    /* Get device descriptor again with new device address */
    ret = usbh_get_device_descriptor(udev, &udev->descriptor);

    if (ret < 0)
    {
        return ret;
    }

    /*------------------------------------------------------------------------------------*/
    /*  Get configuration descriptor                                                      */
    /*------------------------------------------------------------------------------------*/

    conf = (DESC_CONF_T *)udev->cfd_buff;   /* using the previously allocated buffer      */
    conf_total_len = conf->wTotalLength;

    /* Get configuration descriptor again with new device address */
    ret = usbh_get_config_descriptor(udev, (uint8_t *)conf, conf_total_len);

    if (ret < 0)
    {
        return ret;
    }

    /* Always select the first configuration */
    ret = usbh_set_configuration(udev, udev->cur_conf);

    if (ret < 0)
    {
        USB_debug("Set configuration %d failed!\n", udev->cur_conf);
        return ret;
    }

    /* Parse the configuration/interface/endpoint descriptors and find corresponding drivers. */
    ret = usbh_parse_configuration(udev, (uint8_t *)conf);

    if (ret < 0)
    {
        USB_debug("Parse configuration %d failed!\n", conf->bConfigurationValue);
        return ret;
    }

    /* Enable remote wakeup                                                                   */
    if (usbh_ctrl_xfer(udev, REQ_TYPE_OUT | REQ_TYPE_STD_DEV | REQ_TYPE_TO_DEV,
                       USB_REQ_SET_FEATURE, 0x01, 0x0000, 0x0000,
                       USBNULL, &read_len, 300) < 0)
    {
        USB_debug("Device does not accept remote wakeup enable command.\n");
    }

    if (g_conn_func)
    {
        (void)g_conn_func(udev, 0);
    }

    return ret;
}

void disconnect_device(UDEV_T *udev)
{
    IFACE_T      *iface;

    USB_debug("disconnect device...\n");

    if (g_disconn_func)
    {
        g_disconn_func(udev, 0);
    }

    (void)usbh_quit_xfer(udev, &(udev->ep0));    /* Quit control transfer if hw_pipe is not USBNULL.  */

    /*------------------------------------------------------------------------------------*/
    /* FCall driver's disconnect first to stop application layer transfer requests        */
    /*------------------------------------------------------------------------------------*/
    iface = udev->iface_list;

    while (iface != USBNULL)
    {
        IFACE_T *iface_next = iface->next;

        if (iface->driver && iface->driver->disconnect)
        {
            iface->driver->disconnect(iface);  // stop application layer first (set flag_streaming = 0)
        }

        iface = iface_next;
    }

    /*------------------------------------------------------------------------------------*/
    /* release Interface source                                                             */
    /*------------------------------------------------------------------------------------*/
    iface = udev->iface_list;

    while (iface != USBNULL)
    {
        udev->iface_list = iface->next;
        (void)usbh_free_mem(iface, sizeof(*iface));
        iface = udev->iface_list;
    }

    if (udev->cfd_buff != USBNULL)
    {
        const DESC_CONF_T *conf = (const DESC_CONF_T *)udev->cfd_buff;
        uint16_t total_len = conf->wTotalLength;
        (void)usbh_free_mem(udev->cfd_buff, total_len);
        udev->cfd_buff = USBNULL;
    }

    /* remove device from global device list */
    free_dev_address(udev->dev_num);
    free_device(udev);

    (void)usbh_memory_used();
}

#if 0
static int  check_device(UDEV_T *udev)
{
    UDEV_T  *d;

    if (udev == USBNULL)
    {
        return USBH_ERR_INVALID_PARAM;
    }

    //if((udev->hc_driver != &ohci_driver) && (udev->hc_driver != &ehci_driver))
    //    return USBH_ERR_INVALID_PARAM;

    d = g_udev_list;

    while (d)
    {
        if (d == udev)
        {
            return USBH_OK;
        }

        d = d->next;
    }

    return USBH_ERR_INVALID_PARAM;
}
#endif

EP_INFO_T *usbh_iface_find_ep(IFACE_T *iface, uint8_t ep_addr, uint8_t dir_type)
{
    ALT_IFACE_T  *aif = iface->aif;
    int     i;

    if (ep_addr == 0U)      /* find the first EP matched with specified direction and type */
    {
        for (i = 0; i < aif->ifd->bNumEndpoints; i++)
        {
            if (((aif->ep[i].bEndpointAddress & EP_ADDR_DIR_MASK) == (dir_type & EP_ADDR_DIR_MASK)) &&
                    ((aif->ep[i].bmAttributes & EP_ATTR_TT_MASK) == (dir_type & EP_ATTR_TT_MASK)))
            {
                return &aif->ep[i];
            }
        }
    }
    else                   /* find the EP with specified endpoint address                 */
    {
        for (i = 0; i < aif->ifd->bNumEndpoints; i++)
        {
            if (aif->ep[i].bEndpointAddress == ep_addr)
            {
                return &aif->ep[i];
            }
        }
    }

    return USBNULL;
}

void  usbh_dump_buff_bytes(uint8_t *buff, int nSize)
{
    int     nIdx;
    int     i;
    int     nSizeTmp = nSize;

    nIdx = 0;

    while (nSizeTmp > 0)
    {
        USB_debug("0x%04X  ", nIdx);

        for (i = 0; i < 16; i++)
        {
            USB_debug("%02x ", buff[nIdx + i]);
        }

        USB_debug("  ");

        for (i = 0; i < 16; i++)
        {
            if ((buff[nIdx + i] >= (uint8_t)0x20) && (buff[nIdx + i] < (uint8_t)127))
            {
                USB_debug("%c", buff[nIdx + i]);
            }
            else
            {
                USB_debug(".");
            }

            nSizeTmp--;
        }

        nIdx += 16;
        USB_debug("\n");
    }

    USB_debug("\n");
}

void usbh_dump_iface(IFACE_T *iface)
{
    USB_debug("\n  [IFACE info] (0x%x)\n", (int)iface);
    USB_debug("  ----------------------------------------------\n");
    USB_debug("  udev       = 0x%x\n", (int)iface->udev);
    USB_debug("  if_num     = %d\n",   iface->if_num);
    USB_debug("  driver     = 0x%x\n", (int)iface->driver);
    USB_debug("  next       = 0x%x\n", (int)iface->next);
    (void)usbh_dump_interface_descriptor(iface->aif->ifd);
}

void usbh_dump_ep_info(EP_INFO_T *ep)
{
    USB_debug("\n  [Endpoint Info] (0x%x)\n", (int)ep);
    USB_debug("  ----------------------------------------------\n");
    USB_debug("  bEndpointAddress    = 0x%02x\n", ep->bEndpointAddress);
    USB_debug("  bmAttributes        = 0x%02x\n", ep->bmAttributes);
    USB_debug("  bInterval           = %d\n",     ep->bInterval);
    USB_debug("  wMaxPacketSize      = %d\n",     ep->wMaxPacketSize);
    USB_debug("  hw_pipe             = 0x%x\n", (int)ep->hw_pipe);
}

/**
 * @brief  Default debug output function for USB Host Library.
 *         Routes output through standard printf (retargeted to UART by application).
 *         This wrapper isolates the library from direct stdio dependency (MISRA C:2012 Rule 21.6).
 * @param[in] fmt  Format string (printf-compatible)
 * @return  Number of characters printed
 */

// cppcheck-suppress misra-c2012-21.6 ; required for debug output, isolated in single function
int usbh_printf(const char *fmt, ...)
{
    va_list args;
    int     ret;

    va_start(args, fmt);
    ret = vprintf(fmt, args);
    va_end(args);

    return ret;
}


/// @endcond HIDDEN_SYMBOLS
